W7D2/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    msg = UserMailer.welcome_email(u)
    msg.deliver_now

    if @user.save
---
INSERT INTO "users" ("password_digest", "session_token", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"